<?php

$txt['attachment_image_width'] = 'Максимально допустимая ширина прикрепленных изображений.';
$txt['attachment_image_height'] = 'Максимально допустимая высота прикрепленных изображений.';
$txt['attachment_image_reformat'] = 'Разрешить переформатирование изображений, отличных от JPEG, в формат JPEG при изменении размера.';
$txt['attachment_image_sub'] = '(0 без ограничений)';
$txt['attachment_image_post'] = '(большие изображения будут изменены до этого предела)';
$txt['attachment_image_resize'] = 'Изменение Размера Изображения Вложения';
$txt['attachment_image_enabled'] = 'Включить Изменение Размера Изображения Вложения';
$txt['attachment_image_SizeLimit'] = 'Максимальный размер одного вложения';

$txt['helpattachment_image_enabled'] = 'Переключатель включения/выключения для этой функции.';
$txt['helpattachment_image_enabled_size'] = 'или больше, чем %s KB.';
$txt['help_attachment_image_reformat'] = 'Выбор этой опции позволит системе при необходимости переформатировать изображения, отличные от JPEG, в формат JPEG. Система будет пытаться сохранить существующий формат, если только результирующее изображение все еще не превышает максимально допустимый размер файла.';
$txt['help_attachment_image_width'] = 'Это позволяет установить максимальную ширину для вложенных изображений. Изображения меньше максимального значения не будут затронуты, большие изображения будут пропорционально изменены. Это позволяет вам принять увеличенное изображение при загрузке и изменить его размер для экономии места. Параметр максимальный размер файла по-прежнему применяется.';
$txt['help_attachment_image_height'] = 'Это позволяет установить максимальную высоту для вложенных изображений. Изображения меньше максимального значения не будут затронуты, большие изображения будут пропорционально изменены. Это позволяет вам принять увеличенное изображение при загрузке и изменить его размер для экономии места. Параметр максимальный размер файла по-прежнему применяется.';